ebay/ebay-connector/ebay-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/requests/ebay/esb_getAdFormatLeads_mandatory.xml

<?xml version="1.0" ?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.ebay">
	<soapenv:Header/>
	<soapenv:Body>
		<urn:apiUrl>%s(tradingApiUrl)</urn:apiUrl>
		<urn:appId>%s(appId)</urn:appId>
		<urn:routing>default</urn:routing>
		<urn:authToken>%s(authToken)</urn:authToken>
		<urn:siteId>%s(siteId)</urn:siteId>
		<urn:version>%s(version)</urn:version>
		<urn:method>getAdFortmatLeads</urn:method>
	</soapenv:Body>
</soapenv:Envelope>